In [1]:
import pandas as pd

In [4]:
data=pd.read_csv('iris.csv')
data.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [15]:
# how to locate column with different rows
data[['SepalWidthCm','Species']][2:5]

   SepalWidthCm      Species
2           3.2  Iris-setosa
3           3.1  Iris-setosa
4           3.6  Iris-setosa

In [16]:
# using iloc in analysis
data.iloc[:10]

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa
5   6            5.4           3.9            1.7           0.4  Iris-setosa
6   7            4.6           3.4            1.4           0.3  Iris-setosa
7   8            5.0           3.4            1.5           0.2  Iris-setosa
8   9            4.4           2.9            1.4           0.2  Iris-setosa
9  10            4.9           3.1            1.5           0.1  Iris-setosa

In [18]:
# how to filter data with column and rows

data.iloc[:7, [2,4]]

   SepalWidthCm  PetalWidthCm
0           3.5           0.2
1           3.0           0.2
2           3.2           0.2
3           3.1           0.2
4           3.6           0.2
5           3.9           0.4
6           3.4           0.3

In [22]:
# HOW TO DEAL WITH NULL VALUES IN PANDAS
import numpy as np
data2 = {'science':[np.nan,53,55,23,43],
        'math':[12,42,52,23,73],
        'cre':[62,43,np.nan,24,33],
        'social':[32,63,55,53,23]}

In [23]:
data2 = pd.DataFrame(data2)
data2

   science  math   cre  social
0      NaN    12  62.0      32
1     53.0    42  43.0      63
2     55.0    52   NaN      55
3     23.0    23  24.0      53
4     43.0    73  33.0      23

In [26]:
data2.isna().sum()

science    1
math       0
cre        1
social     0
dtype: int64

In [32]:
data2.fillna(1.2)

   science  math   cre  social
0      1.2    12  62.0      32
1     53.0    42  43.0      63
2     55.0    52   1.2      55
3     23.0    23  24.0      53
4     43.0    73  33.0      23

In [30]:
a =data2.dropna()
a

   science  math   cre  social
1     53.0    42  43.0      63
3     23.0    23  24.0      53
4     43.0    73  33.0      23

In [31]:
b =data2.dropna(axis=1)
b

   math  social
0    12      32
1    42      63
2    52      55
3    23      53
4    73      23

# Statistics

In [33]:
data2

   science  math   cre  social
0      NaN    12  62.0      32
1     53.0    42  43.0      63
2     55.0    52   NaN      55
3     23.0    23  24.0      53
4     43.0    73  33.0      23

In [34]:
# getting sum of column and rows
data2['science'].sum()

174.0

In [35]:
data2.loc[0].sum()

106.0

In [36]:
#Getting the mean of columns and rows
data2['science'].mean()

43.5

In [38]:
data2.loc[0].mean()

35.333333333333336

In [41]:
# getting the cumulative sum
data2['science'].cumsum()

0      NaN
1     53.0
2    108.0
3    131.0
4    174.0
Name: science, dtype: float64

In [42]:
data2.loc[0].cumsum()

science      NaN
math        12.0
cre         74.0
social     106.0
Name: 0, dtype: float64

In [43]:
#gettinn the minimum value in a column or a row
data2['science'].min()

23.0

In [44]:
data2.loc[0].min()

12.0

In [45]:
#gettinn the count value of a column or a row
data2['science'].count()

4

In [48]:
data2.loc[2].count()

3

In [50]:
data2['english']=[23,32,34,56,54]
data2

   science  math   cre  social  english
0      NaN    12  62.0      32       23
1     53.0    42  43.0      63       32
2     55.0    52   NaN      55       34
3     23.0    23  24.0      53       56
4     43.0    73  33.0      23       54

In [51]:
data2['science'].count()

4

In [52]:
data2.loc[2].count()

4

In [54]:
data2.loc[5] = [23,45,65,54,65]
data2

   science  math   cre  social  english
0      NaN    12  62.0      32       23
1     53.0    42  43.0      63       32
2     55.0    52   NaN      55       34
3     23.0    23  24.0      53       56
4     43.0    73  33.0      23       54
5     23.0    45  65.0      54       65

In [55]:
#gettinn the maximum value of a column or a row
data2['science'].max()

55.0

In [56]:
#gettinn the standard deviation of a column or a row
data2['science'].std()

15.646085772486357

In [57]:
#gettinn the variation of a column or a row
data2['science'].var()

244.8

In [58]:
#gettinn the correlation of a table
data2.corr()

          science      math       cre    social   english
science  1.000000  0.468672 -0.141781  0.044441 -0.908565
math     0.468672  1.000000 -0.249564 -0.184312  0.378060
cre     -0.141781 -0.249564  1.000000  0.015872 -0.228725
social   0.044441 -0.184312  0.015872  1.000000  0.017120
english -0.908565  0.378060 -0.228725  0.017120  1.000000